{"class_name": "Model", "config": {"name": "CBAM_ON_NEW_DATA_CV7_fixed_redundancy_no_z_class_no_weight", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 61, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_29", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_29", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_36", "inbound_nodes": [[["conv1d_29", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_24", "inbound_nodes": [[["activation_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_29", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_29", "inbound_nodes": [[["dropout_24", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_30", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_30", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_37", "inbound_nodes": [[["conv1d_30", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_25", "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_30", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_30", "inbound_nodes": [[["dropout_25", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_27", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_27", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_31", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_31", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_34", "inbound_nodes": [[["conv1d_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_38", "inbound_nodes": [[["conv1d_31", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_22", "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_26", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_26", "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_27", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_27", "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_31", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_31", "inbound_nodes": [[["dropout_26", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_26", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_26", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_28", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_28", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_32", "inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_33", "inbound_nodes": [[["conv1d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_35", "inbound_nodes": [[["conv1d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_39", "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_21", "inbound_nodes": [[["activation_33", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_23", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_27", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_27", "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_26", "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_28", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_28", "inbound_nodes": [[["dropout_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_32", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_32", "inbound_nodes": [[["dropout_27", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": -1}, "name": "concatenate_6", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}], ["batch_normalization_28", 0, 0, {}], ["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_33", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_33", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_3", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "data_format": "channels_last"}, "name": "global_average_pooling1d_3", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_3", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "data_format": "channels_last"}, "name": "global_max_pooling1d_3", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "target_shape": [1, 384]}, "name": "reshape_6", "inbound_nodes": [[["global_average_pooling1d_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "target_shape": [1, 384]}, "name": "reshape_7", "inbound_nodes": [[["global_max_pooling1d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["reshape_6", 0, 0, {}]], [["reshape_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "relu"}, "name": "activation_40", "inbound_nodes": [[["dense_6", 0, 0, {}]], [["dense_6", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["activation_40", 0, 0, {}]], [["activation_40", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "sigmoid"}, "name": "activation_41", "inbound_nodes": [[["dense_7", 0, 0, {}]], [["dense_7", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}}, "name": "add_3", "inbound_nodes": [[["activation_41", 0, 0, {}], ["activation_41", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "sigmoid"}, "name": "activation_42", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}}, "name": "multiply_6", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}], ["activation_42", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6TS4vY2JhbV9pbmNlcHRpb25fdGZp\nb19uZXdfZG91YmxlX2F0dGVudGlvbl9yYWRhbV9sYXN0X2xheWVyX2F0dGVudGlvbl9taXNoLnB5\n2gg8bGFtYmRhPmMBAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPpNLi9jYmFtX2luY2VwdGlvbl90Zmlv\nX25ld19kb3VibGVfYXR0ZW50aW9uX3JhZGFtX2xhc3RfbGF5ZXJfYXR0ZW50aW9uX21pc2gucHna\nCDxsYW1iZGE+ZgEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_10", "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": -1}, "name": "concatenate_7", "inbound_nodes": [[["lambda_9", 0, 0, {}], ["lambda_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 1, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_33", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 384, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_34", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "sigmoid"}, "name": "activation_43", "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_34", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_34", "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}}, "name": "multiply_7", "inbound_nodes": [[["multiply_6", 0, 0, {}], ["activation_43", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpNLi9jYmFtX2luY2VwdGlvbl90ZmlvX25l\nd19kb3VibGVfYXR0ZW50aW9uX3JhZGFtX2xhc3RfbGF5ZXJfYXR0ZW50aW9uX21pc2gucHnaCDxs\nYW1iZGE+8gEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [61, 384], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.2}}, "name": "lambda_11", "inbound_nodes": [[["batch_normalization_34", 0, 0, {}], ["multiply_7", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_38", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_38", "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_47", "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_31", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_31", "inbound_nodes": [[["activation_47", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_38", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_38", "inbound_nodes": [[["dropout_31", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_39", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_39", "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_48", "inbound_nodes": [[["conv1d_39", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_32", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_32", "inbound_nodes": [[["activation_48", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_39", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_39", "inbound_nodes": [[["dropout_32", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_36", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_36", "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_40", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_40", "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_45", "inbound_nodes": [[["conv1d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_49", "inbound_nodes": [[["conv1d_40", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_29", "inbound_nodes": [[["activation_45", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_33", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_33", "inbound_nodes": [[["activation_49", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_36", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_36", "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_40", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_40", "inbound_nodes": [[["dropout_33", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_35", "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_37", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_37", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_41", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_41", "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_44", "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_46", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_46", "inbound_nodes": [[["conv1d_37", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_50", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_50", "inbound_nodes": [[["conv1d_41", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_28", "inbound_nodes": [[["activation_44", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_30", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_30", "inbound_nodes": [[["activation_46", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_34", "inbound_nodes": [[["activation_50", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_35", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_35", "inbound_nodes": [[["dropout_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_37", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_37", "inbound_nodes": [[["dropout_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_41", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_41", "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": -1}, "name": "concatenate_8", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}], ["batch_normalization_37", 0, 0, {}], ["batch_normalization_41", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_42", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_42", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_4", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "data_format": "channels_last"}, "name": "global_average_pooling1d_4", "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_4", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "data_format": "channels_last"}, "name": "global_max_pooling1d_4", "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "target_shape": [1, 384]}, "name": "reshape_8", "inbound_nodes": [[["global_average_pooling1d_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "target_shape": [1, 384]}, "name": "reshape_9", "inbound_nodes": [[["global_max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["reshape_8", 0, 0, {}]], [["reshape_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "relu"}, "name": "activation_51", "inbound_nodes": [[["dense_8", 0, 0, {}]], [["dense_8", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["activation_51", 0, 0, {}]], [["activation_51", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_52", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "sigmoid"}, "name": "activation_52", "inbound_nodes": [[["dense_9", 0, 0, {}]], [["dense_9", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}}, "name": "add_4", "inbound_nodes": [[["activation_52", 0, 0, {}], ["activation_52", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_53", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "sigmoid"}, "name": "activation_53", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_8", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}}, "name": "multiply_8", "inbound_nodes": [[["batch_normalization_42", 0, 0, {}], ["activation_53", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6TS4vY2JhbV9pbmNlcHRpb25fdGZp\nb19uZXdfZG91YmxlX2F0dGVudGlvbl9yYWRhbV9sYXN0X2xheWVyX2F0dGVudGlvbl9taXNoLnB5\n2gg8bGFtYmRhPmMBAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["multiply_8", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPpNLi9jYmFtX2luY2VwdGlvbl90Zmlv\nX25ld19kb3VibGVfYXR0ZW50aW9uX3JhZGFtX2xhc3RfbGF5ZXJfYXR0ZW50aW9uX21pc2gucHna\nCDxsYW1iZGE+ZgEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_13", "inbound_nodes": [[["multiply_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": -1}, "name": "concatenate_9", "inbound_nodes": [[["lambda_12", 0, 0, {}], ["lambda_13", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_42", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 1, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_42", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_54", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "sigmoid"}, "name": "activation_54", "inbound_nodes": [[["conv1d_42", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_9", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}}, "name": "multiply_9", "inbound_nodes": [[["multiply_8", 0, 0, {}], ["activation_54", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpNLi9jYmFtX2luY2VwdGlvbl90ZmlvX25l\nd19kb3VibGVfYXR0ZW50aW9uX3JhZGFtX2xhc3RfbGF5ZXJfYXR0ZW50aW9uX21pc2gucHnaCDxs\nYW1iZGE+8gEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [61, 384], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.2}}, "name": "lambda_14", "inbound_nodes": [[["lambda_11", 0, 0, {}], ["multiply_9", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_12", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_46", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_46", "inbound_nodes": [[["lambda_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_14", "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_58", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "activation": "Addons>mish"}}}, "name": "activation_58", "inbound_nodes": [[["conv1d_46", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_10", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_38", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_38", "inbound_nodes": [[["activation_58", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": {"class_name": "Policy", "config": {"name": "mixed_float16"}}, "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": 